Revit 2027 API
IFCParameterTemplate.RemovePropertyMappingInfo(PropertySetupType, String, ElementId) Method
 Removes the property mapping from the property set by id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemovePropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	ElementId revitPropertyId
)
Public Sub RemovePropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	revitPropertyId As ElementId
)
public:
void RemovePropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	ElementId^ revitPropertyId
)
member RemovePropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        revitPropertyId : ElementId -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
revitPropertyId ElementId
 The Revit property id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
RemovePropertyMappingInfo Overload
Autodesk.Revit.DB Namespace